import 'package:flutter/material.dart';


// ignore: must_be_immutable
class Ed3oni extends StatefulWidget {
  const Ed3oni({super.key});

  @override
  State<Ed3oni> createState() => _Ed3oniState();
}

class Azkar {
  String? zekr;
  Azkar({required this.zekr});
}

class _Ed3oniState extends State<Ed3oni> {
  List<Azkar> items = [
    Azkar(zekr: "اللَّهمَّ أَصلِحْ لي دِيني الذي هو عصمةُ أمري، وأَصلِحْ لي دنياي التي فيها معاشي، وأَصلِحْ لي آخرَتي التي فيها مَعادي، واجعلِ الحياةَ زيادةً لي في كل خيرٍ، واجعلِ الموتَ راحةً لي من كلِّ شرٍّ"
),
    Azkar(zekr: "رَبِّ اغْفِرْ لي خَطِيئَتي وجَهْلِي، وإسْرَافِي في أمْرِي كُلِّهِ، وما أنْتَ أعْلَمُ به مِنِّي، اللَّهُمَّ اغْفِرْ لي خَطَايَايَ، وعَمْدِي وجَهْلِي وهَزْلِي، وكُلُّ ذلكَ عِندِي، اللَّهُمَّ اغْفِرْ لي ما قَدَّمْتُ وما أخَّرْتُ، وما أسْرَرْتُ وما أعْلَنْتُ، أنْتَ المُقَدِّمُ وأَنْتَ المُؤَخِّرُ، وأَنْتَ علَى كُلِّ شيءٍ قَدِيرٌ"),
    Azkar(zekr: "اللَّهمَّ إنِّي ظَلَمْتُ نَفْسِي ظُلْمًا كَثِيرًا، ولَا يَغْفِرُ الذُّنُوبَ إلَّا أنْتَ، فَاغْفِرْ لي مِن عِندِكَ مَغْفِرَةً إنَّكَ أنْتَ الغَفُورُ الرَّحِيمُ).[٢٩] (اللَّهُمَّ إنِّي أَعُوذُ بكَ مِن زَوَالِ نِعْمَتِكَ، وَتَحَوُّلِ عَافِيَتِكَ، وَفُجَاءَةِ نِقْمَتِكَ، وَجَمِيعِ سَخَطِكَ)"),


    Azkar(zekr: "(اللَّهمَّ إنِّي عبدُكَ، ابنُ عبدِكَ، ابنُ أَمَتِكَ، ناصِيَتي بيدِكَ، ماضٍ فيَّ حُكْمُكَ، عَدْلٌ فيَّ قضاؤُكَ، أسأَلُكَ بكلِّ اسمٍ هو لكَ، سمَّيْتَ به نفسَكَ، أو أنزَلْتَه في كتابِكَ، أو علَّمْتَه أحَدًا مِن خَلْقِكَ، أوِ استأثَرْتَ به في عِلمِ الغيبِ عندَكَ، أنْ تجعَلَ القُرآنَ ربيعَ قلبي، ونورَ بصَري، وجِلاءَ حُزْني، وذَهابَ همِّي"),

    Azkar(zekr: "اللَّهمَّ رَبَّنَا لكَ الحَمْدُ أنْتَ قَيِّمُ السَّمَوَاتِ والأرْضِ، ولَكَ الحَمْدُ أنْتَ رَبُّ السَّمَوَاتِ والأرْضِ ومَن فِيهِنَّ، ولَكَ الحَمْدُ أنْتَ نُورُ السَّمَوَاتِ والأرْضِ ومَن فِيهِنَّ، أنْتَ الحَقُّ، وقَوْلُكَ الحَقُّ، ووَعْدُكَ الحَقُّ، ولِقَاؤُكَ الحَقُّ، والجَنَّةُ حَقٌّ، والنَّارُ حَقٌّ، والسَّاعَةُ حَقٌّ، اللَّهُمَّ لكَ أسْلَمْتُ، وبِكَ آمَنْتُ، وعَلَيْكَ تَوَكَّلْتُ، وإلَيْكَ خَاصَمْتُ، وبِكَ حَاكَمْتُ، فَاغْفِرْ لي ما قَدَّمْتُ وما أخَّرْتُ، وأَسْرَرْتُ وأَعْلَنْتُ، وما أنْتَ أعْلَمُ به مِنِّي، لا إلَهَ إلَّا أنْتَ"),

    Azkar(zekr: '''اللهم إني اسألك بعزك الذي لا يرام، وملكك الذي لا يضام، ونورك الذي ملأ أرجاء عرشك أن تقضي لي حاجتي يا رحمن'''),
    Azkar(zekr: '''اللهم إنك تعلم كل خفية، فاكشف عني كل بلوى تصيبني وأغثني وكن معي، اللهم ارحمني والطف بي وتداركني يا لطيف'''),
    Azkar(zekr: '''اللهم إني اسألك رضًا لا يعقبه سخط، وفرحًا لا يعقبه حزن، اللهم املأ قلبي بكل ما هو خير لي، واقضِ لي حاجتي بقدرتك يا أرحم الراحمين.'''),
    Azkar(zekr: '''اللهم إني اسألك موجبات رحمتك، وعزائم مغفرتك والغنيمة من كل بر والسلامة من كل إثم، اللهم لا تدع لي ذنبًا إلا غفرته، ولا همًّا إلا فرًّجته ولا حاجة هي لك رضًا إلا قضيتها يا أرحم الراحمين.'''),
    Azkar(zekr: '''اللهم إني اسألك باسمك الأعظم الذي إذ سُئلت به أجبت إذا دُعيت به أعطيت أن تقضي لي حاجتي إنَّك على كل شيء قدير.'''),
  Azkar(zekr: '''اللهم إني وكلتك أمري كله جله ودقه وأنت خير وكيل فدبّر لي أمري إنني لا أحسن التدبير.ss'''),

  ];
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(centerTitle: true,
        backgroundColor: const Color.fromARGB(255, 127, 91, 148),
        title: const Text(
          "ادعوني استجب",
          style: TextStyle(
              fontSize: 30, fontWeight: FontWeight.bold, color: Colors.white),
        ),
      ),
      body: ListView.builder(

          itemCount: items.length,
          itemBuilder: ((context, index) {
            return Padding(
              padding: const EdgeInsets.all(8.0),
              child: Card(elevation:8 ,
                shadowColor: Colors.grey,
                color:  const Color.fromARGB(255, 201, 174, 217),
                child: Container(

                  margin: const EdgeInsets.all(10),
                  padding: const EdgeInsets.all(10),
                  decoration: BoxDecoration(
                    borderRadius: BorderRadius.circular(40),

                  ),
                  child: Text("${items[index].zekr}",
                      textAlign: TextAlign.start,
                      style: const TextStyle(
                          fontSize: 18,
                          fontWeight: FontWeight.bold,
                          color: Colors.black)),
                ),
              ),
            );
          })),
    );
  }
}
