import 'package:flutter/material.dart';


// ignore: must_be_immutable
class Hadith extends StatefulWidget {
  const Hadith({super.key});

  @override
  State<Hadith> createState() => _HadithState();
}

class Azkar {
  String? zekr;
  Azkar({required this.zekr});
}

class _HadithState extends State<Hadith> {
  List<Azkar> items = [
    Azkar(zekr: "عَنْ أَمِيرِ المُؤمِنينَ أَبي حَفْصٍ عُمَرَ بْنِ الخَطَّابِ قَالَ : سَمِعْتُ رَسُولَ اللهِ ﷺ يَقُولُ :  إِنَّمَا الأَعْمَالُ بِالنِّيَّاتِ ، وَإنَّمَا لِكُلِّ امْرِىءٍ مَا نَوَى ، فَمَنْ كَانَتْ هِجْرَتُهُ إِلى اللهِ وَرَسُوله فَهِجْرتُهُ إلى اللهِ وَرَسُوُله ، وَمَنْ كَانَتْ هِجْرَتُهُ لِدُنْيَا يُصِيْبُهَا ، أَو امْرأَةٍ يَنْكِحُهَا ، فَهِجْرَتُهُ إِلى مَا هَاجَرَ إلَيْهِ  "),
    Azkar(zekr: "عَنْ أَبِيْ عَبْدِ الرَّحْمَنِ عَبْدِ اللهِ بْنِ عُمَرَ بْن الخَطَّابِ رَضِيَ اللهُ عَنْهُمَا قَالَ: سَمِعْتُ النبي ﷺ يَقُوْلُ:  بُنِيَ الإِسْلامُ عَلَى خَمْسٍ: شَهَادَةِ أَنْ لاَ إِلَهَ إِلاَّ الله وَأَنَّ مُحَمَّدَاً رَسُوْلُ اللهِ، وَإِقَامِ الصَّلاةِ، وَإِيْتَاءِ الزَّكَاةِ، وَحَجِّ البِيْتِ، وَصَوْمِ رَمَضَانَ "),

    Azkar(zekr: "عَنْ أُمِّ المُؤمِنِينَ أُمِّ عَبْدِ اللهِ عَائِشَةَ - رَضِيَ اللهُ عَنْهَا - قَالَتْ: قَالَ رَسُوْلُ اللهِ :  مَنْ أَحْدَثَ فِيْ أَمْرِنَا هَذَا مَا لَيْسَ مِنْهُ فَهُوَ رَدٌّ  رواه البخاري ومسلم، وفي رواية لمسلم  مَنْ عَمِلَ عَمَلاً لَيْسَ عَلَيْهِ أَمْرُنَا فَهُوَ رَدٌّ "),
    Azkar(zekr: "عَنْ أَبِي مُحَمَّدٍ الحَسَنِ بنِ عَلِيّ بنِ أبِي طالبٍ سِبْطِ رَسُولِ اللهِ ﷺ وَرَيْحَانَتِهِ رَضِيَ اللهُ عَنْهُمَا قَالَ: حَفِظْتَ مِنْ رَسُوْلِ اللهِ ﷺ : (دَعْ مَا يَرِيْبُكَ إِلَى مَا لاَ يَرِيْبُكَ) رواه الترمذي والنسائي وقال الترمذي: حديث حسن صحيح"),




  Azkar(zekr: '''قال رسول الله صلى الله عليه وسلم: (إنَّ مِن أحبِّكم إليَّ وأقربِكُم منِّي مجلسًا يومَ القيامةِ أحاسنَكُم أخلاقًا'''),
  Azkar(zekr:'''قال رسول الله صلى الله عليه وسلم: (ما اجتمَعَ قومٌ في بيتٍ من بيوتِ اللَّهِ يتلونَ كتابَ اللَّهِ، ويتدارسونَهُ فيما بينَهم إلَّا نزلَت عليهِم السَّكينةُ، وغشِيَتهُمُ الرَّحمةُ، وحفَّتهُمُ الملائكَةُ، وذكرَهُمُ اللَّهُ فيمَن عندَهُ)'''),

  Azkar(zekr: '''قال رسول الله صلى الله عليه وسلم: (مَثَلُ المُؤْمِنِ الذي يَقْرَأُ القُرْآنَ، مَثَلُ الأُتْرُجَّةِ، رِيحُها طَيِّبٌ وطَعْمُها طَيِّبٌ، ومَثَلُ المُؤْمِنِ الذي لا يَقْرَأُ القُرْآنَ مَثَلُ التَّمْرَةِ، لا رِيحَ لها وطَعْمُها حُلْوٌ)'''),
  Azkar(zekr: '''قال رسول الله صلى الله عليه وسلم: (لا حَسَدَ إلَّا في اثْنَتَيْنِ: رَجُلٌ عَلَّمَهُ اللَّهُ القُرْآنَ، فَهو يَتْلُوهُ آناءَ اللَّيْلِ، وآناءَ النَّهارِ، فَسَمِعَهُ جارٌ له، فقالَ: لَيْتَنِي أُوتِيتُ مِثْلَ ما أُوتِيَ فُلانٌ، فَعَمِلْتُ مِثْلَ ما يَعْمَلُ).[١١]'''),
    Azkar(zekr: '''قال رسول الله صلى الله عليه وسلم: (مَنْ قال لا إلهَ إلَّا اللهُ وحدَهُ لَا شرِيكَ لَهُ ، لَهُ الملْكُ ، ولَهُ الحمْدُ ، وهُوَ عَلَى كُلِّ شيءٍ قديرٌ ، فِي يومٍ مائَةَ مرةٍ ، كانتْ لَهُ عِدْلَ عشرِ رقابٍ ، وكُتِبَتْ لَهُ مائَةُ حسنَةٍ ، ومُحِيَتْ عنه مائَةُ سيِّئَةٍ ، وكانَتْ لَهُ حِرْزًا منَ الشيطانِ يَوْمَهُ ذَلِكَ حتى يُمْسِيَ ، ولم يأتِ أحدٌ بأفضلَ مِمَّا جاءَ بِهِ ، إلَّا أحدٌ عَمِلَ عملًا أكثرَ مِنْ ذلِكَ)'''),

    Azkar(zekr: '''قال رسول الله صلى الله عليه وسلم: (مَن سَبَّحَ اللَّهَ في دُبُرِ كُلِّ صَلاةٍ ثَلاثًا وثَلاثِينَ، وحَمِدَ اللَّهَ ثَلاثًا وثَلاثِينَ، وكَبَّرَ اللَّهَ ثَلاثًا وثَلاثِينَ، فَتْلِكَ تِسْعَةٌ وتِسْعُونَ، وقالَ: تَمامَ المِئَةِ: لا إلَهَ إلَّا اللَّهُ وحْدَهُ لا شَرِيكَ له، له المُلْكُ وله الحَمْدُ وهو علَى كُلِّ شيءٍ قَدِيرٌ غُفِرَتْ خَطاياهُ وإنْ كانَتْ مِثْلَ زَبَدِ البَحْرِ)'''),

    Azkar(zekr: '''قال رسول الله صلى الله عليه وسلم: (مَن قالَ: لا إلَهَ إلَّا اللَّهُ وَحْدَهُ لا شَرِيكَ له، له المُلْكُ وَلَهُ الحَمْدُ وَهو علَى كُلِّ شيءٍ قَدِيرٌ، عَشْرَ مِرَارٍ كانَ كَمَن أَعْتَقَ أَرْبَعَةَ أَنْفُسٍ مِن وَلَدِ إسْمَاعِيلَ).['''),

    Azkar(zekr: '''قال رسول الله صلى الله عليه وسلم: (أَلَا أُخْبِرُكَ بأَحَبِّ الكَلَامِ إلى اللهِ؟ قُلتُ: يا رَسُولَ اللهِ، أَخْبِرْنِي بأَحَبِّ الكَلَامِ إلى اللهِ، فَقالَ: إنَّ أَحَبَّ الكَلَامِ إلى اللهِ: سُبْحَانَ اللهِ وَبِحَمْدِهِ)'''),

  ];
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(centerTitle:true ,
        backgroundColor: const Color.fromARGB(255, 127, 91, 148),
        title: const Text(
          "حديث شريف",
          style: TextStyle(
              fontSize: 30, fontWeight: FontWeight.bold, color: Colors.white),
        ),
      ),
      body: ListView.builder(

          itemCount: items.length,
          itemBuilder: ((context, index) {
            return Builder(
              builder: (context) {
                return Padding(
                  padding: const EdgeInsets.all(8.0),
                  child: Card(elevation:8 ,
                    shadowColor: Colors.grey,
                    color: const Color.fromARGB(255, 201, 174, 217),
                    child: Container(


                      margin: const EdgeInsets.all(10),
                      padding: const EdgeInsets.all(5),
                      decoration: BoxDecoration(
                        borderRadius: BorderRadius.circular(40),

                      ),
                      child: Text("${items[index].zekr}",
                          textAlign: TextAlign.start,
                          style: const TextStyle(
                              fontSize: 20,
                              fontWeight: FontWeight.bold,
                              color: Colors.black)),
                    ),
                  ),
                );
              }
            );
          })),
    );
  }
}
